{
    "title": "Saadat Taaseen",
    "experience": [
        {
            "title": "Software Engineer",
            "date": "Jul 2022 - Nov 2022",
            "company": "DatafuelX",
            "location": "Manhattan, NY",
            "website": "",
            "industry": "Ad-Tech",
            "responsibilities": [
                "Created Front-end website using Vue JS framework for client facing interaction.", 
                "Hosted website on AWS S3 buckets and performed routine deployments with updated features.", 
                "Connected and Interacted with backend API for authentication and RESTful web services in a fast-paced Agile Environment.",
                "Presented UX/UI designs, and used complex algorithms to create dynamic websites with high-performance software engineering and quantitative development."
            ]
        },
        {
            "title": "Software Engineer",
            "date": "Nov 2021 - Jun 2022",
            "company": "CareerMD - Elevation Health Group",
            "location": "New York, NY",
            "website": "www.careermd.com",
            "industry": "Healthcare",
            "responsibilities": [
                "Created 30+ dynamic web pages on Vue TypeScript with REST API asynchronous Integration, increasing website traffc and engagement by 30% according to google analytics.",
                "Worked in charge of IT and ticketing systems to help clients and employees resolve software issues.",
                "Increased work efficiency by 23%, and improved security flaws by replacing legacy code with updated authentication practices.",
                "Created various microservices and websites using ReactJS and NodeJS for use internally by employees to access information.",
                "Worked with AWS EC2 engines and S3 buckets, and added public servers using Docker images. Added cron tasks and automated microservices allowing for a 50% decrease in time spent on manual tasks, and a 20% increase in productivity, according to end-quarter reports.",
                "Used SQL servers to update entries for candidates and career fair events."
            ]
        },
        {
            "title": "Remote Software Engineer",
            "date": "Jan 2021 - Nov 2021",
            "company": "Tred Earth",
            "location": "Leeds, UK",
            "website": "www.tred.earth",
            "industry": "Banking",
            "responsibilities": [
                "An essential stakeholder in workflow and lifecycle decisions made with founders and as Project Lead for 3 other developers to deliver projects within a precise deadline to hit a crowdfunding goal of over 30,000 people.",
                "Used React-NextJS and Material UI to create webpages with efficient, scalable code to increase website traffic and engagement by 20%, measured through google analytics.",
                "Testing and deployment in an agile environment, troubleshooting, debugging, maintaining, and improving existing code, designing new pages, experimental features, and seasonal components, and deploying to production."
            ]
        },
        {
            "title": "QC Analyst",
            "date": "Nov 2016 - February 2020",
            "company": "Akorn Pharmaceuticals",
            "location": "New York, NY",
            "website": "",
            "industry": "Healthcare",
            "responsibilities": [
                "Responsible for proper and immediate documentation of daily activities, and release of tested samples within strict deadlines.",
                "Performed various chemical and physical tests such as HPLC and Dissolution of chemical products for quality control.",
                "Worked with the tech department to analyze and edit legacy code. Changed code settings for HPLC and UPLC systems to change motor timings, and fix efficiency for analysis.",
                "Used Python to SSH into external computers to run program analytics for different chemical products."
            ]
        }
    ],
    "skills": [
        {
            "type": "Languages",
            "list": ["JavaScript", "TypeScript", "Ruby", "C Programming", "Python"]
        },
        {
            "type":"Tools",
            "list": ["React", "React-Native", "Vue", "Node.js", "Express", "Ruby on Rails", "Git", "AWS"]
        },
        {
            "type":"Database",
            "list": ["PostgreSQL", "MySQL", "MongoDB", "Firebase", "SQLite"]
        },
        {
            "type":"Experience",
            "list": ["Full Stack Development", "RESTful APIs", "Authentication", "CRUD operations", "Axios", "NextJS", "JSON", "Vuex", "React-Redux", "Bootstrap / Material UI / Vuetify"]
        }
    ],
    "education": [
        {
            "accomplishment": "Certificate",
            "subject": "Software Engineering Immersive",
            "date":"Feb 2020 - Jun 2020",
            "school": "General Assembly",
            "locationAbbr": "NY"
        },
        {
            "accomplishment": "Bachelor of Science",
            "subject": "",
            "date":"Dec 2015",
            "school": "SUNY Stony Brook",
            "locationAbbr": "NY"
        },
        {
            "accomplishment": "Associates in Science, Chemical Engineering",
            "subject": "",
            "date":"Jun 2013",
            "school": "CUNY Hostos CC",
            "locationAbbr": "NY"
        }
    ],
    "projects": {
        "subtitle": "All projects are viewable through the following link: www.saadt.dev",
        "projects": [
            {
                "name": "Saad Photography",
                "languages": "React and AWS S3",
                "description": "Created a website with AWS S3 Bucket hosting.",
                "link": "https://photography.saadt.dev"
            },
            {
                "name": "Instagram Clone",
                "languages": "React and Firebase",
                "description": "Created a photo hosting website that uses Firebase web security and database to create, edit and delete users, posts and comments.",
                "link": "https://instaclone-saad.netlify.app"
            }, 
            {
                "name": "Compostrack",
                "languages": "React, Mapbox and NodeJS",
                "description": "Worked with UX/UI designers to create a website with authentication, functional map, geolocations, address search, and a “Pin” bookmarking feature.",
                "link": "https://compostrack.netlify.app/"
            },
            {
                "name": "Music-App",
                "languages": "React",
                "description": "A Music app created using React.js that displays currently playing music, and a library of songs that can be selected. The website features a beautiful User Interface and SASS extensions for better CSS usability.",
                "link": "https://trance.saadt.dev"
            }
        ]
    },
    "hobbies": [],
    "JSON Commented Info": [
        {
            "title": "Software Engineering Fellow",
            "date": "Feb 2020 - June 2020",
            "company": "General Assembly",
            "location": "New York Metropolitan Area, NY",
            "website": "",
            "industry": "",
            "responsibilities": [
                "Completed 18 weeks of Full Stack Web Development training. I learned how to:",
                "Write REST APIs, call third-party APIs, deploy backend servers, and authenticate users and API calls.",
                "Build full-stack web applications with the Model-View-Controller framework.",
                "Collaborate with UX / UI designers to create functional and responsive websites.",
                "Create code in multiple programming languages and frameworks, such as React, Vue, Ruby on Rails, and Node / Express JS."
            ]
        }
    ] 
}